docs/performance/rapports/2026-09-16-k6-smoke-lecture.txt
     execution: local
        script: /scripts/gateway-lecture.js
        output: -
     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m20s max duration (incl. graceful stop):
              * lecture: Up to 5 looping VUs for 1m10s over 3 stages (gracefulRampDown: 10s, gracefulStop: 30s)

  █ THRESHOLDS

    http_req_duration{name:GET /health}
    ✓ 'p(95)<200' p(95)=4.82ms

    http_req_duration{name:GET /products}
    ✓ 'p(95)<500' p(95)=17.4ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 792     11.295399/s
    checks_succeeded...: 100.00% 792 out of 792
    checks_failed......: 0.00%   0 out of 792

    ✓ health 200
    ✓ liste 200
    ✓ détail 200

    HTTP
    http_req_duration..............: avg=9.46ms  min=2.22ms med=10.57ms max=66.28ms p(90)=13.97ms p(95)=15.61ms p(99)=31.3ms
      { expected_response:true }...: avg=9.46ms  min=2.22ms med=10.57ms max=66.28ms p(90)=13.97ms p(95)=15.61ms p(99)=31.3ms
      { name:GET /health }.........: avg=3.67ms  min=2.22ms med=3ms     max=66.28ms p(90)=3.82ms  p(95)=4.82ms  p(99)=13.14ms
      { name:GET /products }.......: avg=12.39ms min=8.38ms med=11.47ms max=42.68ms p(90)=15.17ms p(95)=17.4ms  p(99)=31.2ms
    http_req_failed................: 0.00%  0 out of 793
    http_reqs......................: 793    11.309661/s

    EXECUTION
    iteration_duration.............: avg=1.03s   min=1.02s  med=1.02s   max=1.12s   p(90)=1.03s   p(95)=1.04s   p(99)=1.07s
    iterations.....................: 264    3.765133/s
    vus............................: 1      min=0        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 3.4 MB 48 kB/s
    data_sent......................: 80 kB  1.1 kB/s



running (1m10.1s), 0/5 VUs, 264 complete and 0 interrupted iterations
lecture ✓ [ 100% ] 0/5 VUs  1m10s